[Killed] ConditionalExpression
GitHub/silly-pascal-mutation/src/silly-pascal.ts:3:7
 function isLetter(character: string): boolean {
   const asciiCode: number = character.charCodeAt(0);
-  if (asciiCode < 65 || (asciiCode > 90 && asciiCode < 97) || asciiCode > 122)
+  if (true || asciiCode > 122)
     return false;
   return true;
killedBy: C1 - C4 - C6 - L1 - L5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
GitHub/silly-pascal-mutation/src/silly-pascal.ts:3:7
 function isLetter(character: string): boolean {
   const asciiCode: number = character.charCodeAt(0);
-  if (asciiCode < 65 || (asciiCode > 90 && asciiCode < 97) || asciiCode > 122)
+  if (true || (asciiCode > 90 && asciiCode < 97) || asciiCode > 122)
     return false;
   return true;
killedBy: C1 - C4 - C6 - L1 - L5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
GitHub/silly-pascal-mutation/src/silly-pascal.ts:4:12
 function isLetter(character: string): boolean {
   const asciiCode: number = character.charCodeAt(0);
   if (asciiCode < 65 || (asciiCode > 90 && asciiCode < 97) || asciiCode > 122)
-    return false;
+    return true;
   return true;
 }
killedBy: C5 - L1 - L7
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
GitHub/silly-pascal-mutation/src/silly-pascal.ts:10:25
 
 function isNumber(character: string): boolean {
   const asciiCode: number = character.charCodeAt(0);
-  if (asciiCode > 47 && asciiCode < 58) return true;
+  if (asciiCode > 47 && true) return true;
   return false;
 }
killedBy: C7 - L6 - L8
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] EqualityOperator
GitHub/silly-pascal-mutation/src/silly-pascal.ts:10:25
 
 function isNumber(character: string): boolean {
   const asciiCode: number = character.charCodeAt(0);
-  if (asciiCode > 47 && asciiCode < 58) return true;
+  if (asciiCode > 47 && asciiCode >= 58) return true;
   return false;
 }
killedBy: C1 - C4 - C6 - L4 - L6 - L5 - L8
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BooleanLiteral
GitHub/silly-pascal-mutation/src/silly-pascal.ts:11:10
 function isNumber(character: string): boolean {
   const asciiCode: number = character.charCodeAt(0);
   if (asciiCode > 47 && asciiCode < 58) return true;
-  return false;
+  return true;
 }
 
killedBy: C7 - L6 - L8
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
GitHub/silly-pascal-mutation/src/silly-pascal.ts:15:7
 }
 
 export default function isValid(input: string): boolean {
-  if (input.length < 1 || input.length > 6) return false;
+  if (false) return false;
 
   const characters: Array<string> = input.split('');
killedBy: C2 - L1
statusReason: TypeError: Cannot read property 'charCodeAt' of undefined

[Killed] ConditionalExpression
GitHub/silly-pascal-mutation/src/silly-pascal.ts:15:7
 }
 
 export default function isValid(input: string): boolean {
-  if (input.length < 1 || input.length > 6) return false;
+  if (false || input.length > 6) return false;
 
   const characters: Array<string> = input.split('');
killedBy: C2 - L1
statusReason: TypeError: Cannot read property 'charCodeAt' of undefined

[Killed] BooleanLiteral
GitHub/silly-pascal-mutation/src/silly-pascal.ts:19:7
 
   const characters: Array<string> = input.split('');
 
-  if (!isLetter(characters[0])) return false;
+  if (isLetter(characters[0])) return false;
 
   let silly: boolean = true;
killedBy: C1 - C4 - C6 - L1 - L5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
GitHub/silly-pascal-mutation/src/silly-pascal.ts:19:40
 
   const characters: Array<string> = input.split('');
 
-  if (!isLetter(characters[0])) return false;
+  if (!isLetter(characters[0])) return true;
 
   let silly: boolean = true;
killedBy: C5 - L1 - L7
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
GitHub/silly-pascal-mutation/src/silly-pascal.ts:21:24
 
   if (!isLetter(characters[0])) return false;
 
-  let silly: boolean = true;
+  let silly: boolean = false;
 
   characters.forEach((character) => {
killedBy: C1 - C4 - C6 - L1 - L5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
GitHub/silly-pascal-mutation/src/silly-pascal.ts:23:37
 
   let silly: boolean = true;
 
-  characters.forEach((character) => {
-    if (!isLetter(character) && !isNumber(character)) silly = false;
-  });
+  characters.forEach((character) => {});
 
   return silly;
killedBy: C7 - L6 - L8
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BooleanLiteral
GitHub/silly-pascal-mutation/src/silly-pascal.ts:24:33
   let silly: boolean = true;
 
   characters.forEach((character) => {
-    if (!isLetter(character) && !isNumber(character)) silly = false;
+    if (!isLetter(character) && isNumber(character)) silly = false;
   });
 
killedBy: C1 - C4 - C6 - L4 - L6 - L5 - L8
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BooleanLiteral
GitHub/silly-pascal-mutation/src/silly-pascal.ts:24:9
   let silly: boolean = true;
 
   characters.forEach((character) => {
-    if (!isLetter(character) && !isNumber(character)) silly = false;
+    if (isLetter(character) && !isNumber(character)) silly = false;
   });
 
killedBy: C1 - C4 - C6 - L1 - L5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
